import 'package:educationapp/BookApps/PoemModel/PoemModel.dart';

class PoemSource {
  static List<PoemModel> Poems = [
    // static ব্যবহার করলে সেগুলো কে আর ক্লাসের অবজেক্ট বা ইন্সটেন্স তৈরি করা লাগবে না,
    // PoemModel(PoemName, Writername, Poem);
    PoemModel("জ্যোৎস্না রাতে ", "সুমি হোসাইন ",
        '''ফিনিক ফোটা জোস্না রাতে, শিশির ভেজা ঘাসে
    মন বাতাসের ঢেউয়ের দোলায়, হয়তো কেউ হাসে।
    কেউবা আবার কষ্ট নামক জাহাজটাতে, 
    চোখ ভিজিয়ে ভাসে।
    স্বপ্ন নামক মরীচিকায় কেউবা দোলে রাতে। 
    সূর্যমামা ডাক দিয়ে সব দিনের শুরুতে 
    অন্ধকারের কষ্টকে সব দেয় যে উড়িয়ে।
    দিনটা যায় যেমন তেমন রাত্রিরটা ভীষন কালো 
    এভাবেই জীবন যাচ্ছে চলে ভীষন ভালো।
    '''),
    PoemModel("মৃত্যু আমার কালো যমজ", "আবিদ আনোয়ার",
        ''' তোমার কাছে যাবো বলেই তৈরি হয়ে আছি,
      বিদায় নিতে পরান্মুখ ছিলাম বটে আগে:
      পথ আগলে রেখেছে চোরা স্মৃতির মৌমাছি,
      থাকে তো কিছু অঙ্গীকারও পাওয়ার দায়ভাগে।
      পা ফেলতেই ঘোর তমসা, পেলো নিশির ডাকে,
      সসীম থেকে অসীমে যাওয়া সহজ কাজ নয়:
      সরল-সোজা পদক্ষেপে কিংবা বাঁকে-বাঁকে
      নতুন পথে দাঁড়িয়ে থাকে দানোর মতো ভয়!
      আমার সাথে জন্মেছিলে কালো যমজ তুমি
      খুব গোপনে পালিয়ে গেলে তখনি পরপারে;  '''),
    PoemModel("আত্ম-অস্ত্রাগার", "মোহাম্মদ রফিকউজ্জামান",
        '''মাথার উপরে এক শয়তানের কু-বিশাল ছায়া।।
    কুচক্রী চক্রের দশা হয়ে মেলে আছে তার মহাজনী খাতা।।
    আমি এই দৃশ্য থেকে মুক্তি চাই, এই সব কুমন্ত্রের মায়া।।
    ছিন্ন করে হতে চাই অদৃষ্টের আপন বিধাতা।।
    অথচ ছায়ার সাথে যুদ্ধ করা যায় না কখনো।।
    ছায়াধারীকেই তাই প্রত্যহ সন্ধান করি আমি।।
    নিজেকে কঠিন স্বরে বলি, অস্তিত্বের বীজ বোনো।।
    নিজের গভীরে আর নিজে আঁকো নিজের আগামী।।
    যদিও জেনেছি সব শয়তানেরা জন্ম দেয় অপচ্ছায়াজালে।।
    এমন কুটিল স্বত্বা যার পরে ভর করা যায়।। '''),
    PoemModel("বেদের বহর ", "জসীমউদ্দীন ", '''মধুমতী নদী দিয়া,
    বেদের বহর ভাসিয়া চলেছে কূলে ঢেউ আছাড়িয়া।
    জলের উপরে ভাসাইয়া তারা ঘরবাড়ি সংসার,
    নিজেরাও আজ ভাসিয়া চলেছে সঙ্গ লইয়া তার।
    মাটির ছেলেরা অভিমান করে ছাড়িয়া মায়ের কোল,
    নাম-হীন কত নদী-তরঙ্গে ফিরিছে খাইয়া দোল।
    দুপাশে বাড়ায়ে বাঁকা তট-বাহু সাথে সাথে মাটি ধায়,
    চঞ্চল ছেলে আজিও তাহারে ধরা নাহি দিল হায়।
    কত বন পথ সুশীতল ছায়া ফুল-ফল-ভরা গ্রাম,
    শস্যের খেত আলপনা আঁকি ডাকে তারে অবিরাম!  '''),
    PoemModel("কিছুটা বদলে দাও ", "শাহ জামাল উদ্দিন ",
        '''আজ তুমি আমাকে কিছুটা বদলে দাও
    আমার যা কিছু ভুল ছিল
    সবগুলো ভুল শুধরে দাও।

    আবার আমি বর্ণমালার নদীতে
    নামতার নৌকায় চড়ে
    শৈশব পার করবো তোমাকে নিয়ে ।

    কৈশরে যাবে তুমি আমাকে নিয়ে
    কাশফুলের সাথে পরিচয় করবে নতুন করে
    কচুরীপানার ফুলগুলো তুলবো
    আমরা দুজনে একসাথে ।

    যৌবনের জরুরী চিঠিগুলো
    পড়ে পড়ে শুনাবে আমাকে
    যে গুলো পুরনো বাক্সের ভিতরে
    আজও অখোলা রয়ে গেছে ।

    ছিলাম আমি এতদিন অভিভাবকহীন
    গোলাপের রঙ
    ভালোভাবে দেখায়নি আমাকে
    কেউ কোনদিন
    ঘাসফুলের কাছে যেতে যেতে
    কেটে গেলো বহুদিন
    তুমিই এখন আমার বুকের প্রথম ভায়োলিন । '''),
    PoemModel("কিশোরী মন ", "শাহ জামাল উদ্দিন ", '''যেন তার অল্প বয়সী মন
    মানে না বারন মনে না শাসন
    যদিও অনেক হয়েছে বয়স এখন।

    হরিনীর মত ছোটাছুটি করে
    লোকে কত কি যে বলে
    দরজা বন্ধ করে দিলে
    পালিয়ে যায় জানালার কপাট খুলে ।

    যায় নদী তীরে বরশীতে মাছ ধরে
    সাঁতার কাটে ঘোলাজলে
    মেঠোপথে ঘুরে ঘুরে সন্ধায় বাড়ি ফিরে ।

    প্রজাপতিদের সাথে নিয়ে
    ফুলের বাগানে খেলা করে
    কখনো বসে থাকে চৈত্রের দুপুরে
    মরাগাছের মগডালে
    মনে না বারন মনে না শাসন
    চঞ্চলা হয়ে ওঠে কিশোরী মন
    যদিও অনেক হয়েছে বয়স এখন ।

    মাঝে মাঝে উড়ে যায় মনেমনে
    পাখি হয়ে বহুদূরে
    আবার ফিরে এসে বাস করে
    মায়াময় পৃথিবীর এককোনে নিরবে ।

    যেন তার কিশোরী মন
    মানে না বারন মনে না শাসন । '''),
    PoemModel("শেষ শিরোনাম তুমি ", "শাহ জামাল উদ্দিন ",
        '''বহুদিন পরে বহু খোঁজাখুঁজি করে
    পেয়েছি তোমার হাতে লিখা
    গোপনে রেখে যাওয়া একটি চিঠি- অখোলা
    নিসর্গের নির্জন বালিকা
    সেখানে তোমার নাম লিখা ।

    আমার গোপন পরাজয়
    আজ সবকিছু বললাম তোমাকে
    তুমি মুখ তুলে বললে
    কেন আরো আগে ডাকোনি আমাকে ।

    দুই চোখে জল ভরে তাকালে আমার দিকে
    সব দুঃখ বুকে নিয়ে
    তোমার কোমল আঁচল দিয়ে
    মুছে দিলে আমার ব্যর্থতার গ্লানি
    আমার জীবনের শেষ শিরোনাম তুমি । '''),
    PoemModel("জ্যোৎস্না রাতে ", "সুমি হোসাইন ",
        '''ফিনিক ফোটা জোস্না রাতে, শিশির ভেজা ঘাসে
    মন বাতাসের ঢেউয়ের দোলায়, হয়তো কেউ হাসে।
    কেউবা আবার কষ্ট নামক জাহাজটাতে, 
    চোখ ভিজিয়ে ভাসে।
    স্বপ্ন নামক মরীচিকায় কেউবা দোলে রাতে। 
    সূর্যমামা ডাক দিয়ে সব দিনের শুরুতে 
    অন্ধকারের কষ্টকে সব দেয় যে উড়িয়ে।
    দিনটা যায় যেমন তেমন রাত্রিরটা ভীষন কালো 
    এভাবেই জীবন যাচ্ছে চলে ভীষন ভালো।
    '''),
    PoemModel("মৃত্যু আমার কালো যমজ", "আবিদ আনোয়ার",
        ''' তোমার কাছে যাবো বলেই তৈরি হয়ে আছি,
      বিদায় নিতে পরান্মুখ ছিলাম বটে আগে:
      পথ আগলে রেখেছে চোরা স্মৃতির মৌমাছি,
      থাকে তো কিছু অঙ্গীকারও পাওয়ার দায়ভাগে।
      পা ফেলতেই ঘোর তমসা, পেলো নিশির ডাকে,
      সসীম থেকে অসীমে যাওয়া সহজ কাজ নয়:
      সরল-সোজা পদক্ষেপে কিংবা বাঁকে-বাঁকে
      নতুন পথে দাঁড়িয়ে থাকে দানোর মতো ভয়!
      আমার সাথে জন্মেছিলে কালো যমজ তুমি
      খুব গোপনে পালিয়ে গেলে তখনি পরপারে;  '''),
    PoemModel("আত্ম-অস্ত্রাগার", "মোহাম্মদ রফিকউজ্জামান",
        '''মাথার উপরে এক শয়তানের কু-বিশাল ছায়া।।
    কুচক্রী চক্রের দশা হয়ে মেলে আছে তার মহাজনী খাতা।।
    আমি এই দৃশ্য থেকে মুক্তি চাই, এই সব কুমন্ত্রের মায়া।।
    ছিন্ন করে হতে চাই অদৃষ্টের আপন বিধাতা।।
    অথচ ছায়ার সাথে যুদ্ধ করা যায় না কখনো।।
    ছায়াধারীকেই তাই প্রত্যহ সন্ধান করি আমি।।
    নিজেকে কঠিন স্বরে বলি, অস্তিত্বের বীজ বোনো।।
    নিজের গভীরে আর নিজে আঁকো নিজের আগামী।।
    যদিও জেনেছি সব শয়তানেরা জন্ম দেয় অপচ্ছায়াজালে।।
    এমন কুটিল স্বত্বা যার পরে ভর করা যায়।। '''),
    PoemModel("বেদের বহর ", "জসীমউদ্দীন ", '''মধুমতী নদী দিয়া,
    বেদের বহর ভাসিয়া চলেছে কূলে ঢেউ আছাড়িয়া।
    জলের উপরে ভাসাইয়া তারা ঘরবাড়ি সংসার,
    নিজেরাও আজ ভাসিয়া চলেছে সঙ্গ লইয়া তার।
    মাটির ছেলেরা অভিমান করে ছাড়িয়া মায়ের কোল,
    নাম-হীন কত নদী-তরঙ্গে ফিরিছে খাইয়া দোল।
    দুপাশে বাড়ায়ে বাঁকা তট-বাহু সাথে সাথে মাটি ধায়,
    চঞ্চল ছেলে আজিও তাহারে ধরা নাহি দিল হায়।
    কত বন পথ সুশীতল ছায়া ফুল-ফল-ভরা গ্রাম,
    শস্যের খেত আলপনা আঁকি ডাকে তারে অবিরাম!  '''),
    PoemModel("কিছুটা বদলে দাও ", "শাহ জামাল উদ্দিন ",
        '''আজ তুমি আমাকে কিছুটা বদলে দাও
    আমার যা কিছু ভুল ছিল
    সবগুলো ভুল শুধরে দাও।

    আবার আমি বর্ণমালার নদীতে
    নামতার নৌকায় চড়ে
    শৈশব পার করবো তোমাকে নিয়ে ।

    কৈশরে যাবে তুমি আমাকে নিয়ে
    কাশফুলের সাথে পরিচয় করবে নতুন করে
    কচুরীপানার ফুলগুলো তুলবো
    আমরা দুজনে একসাথে ।

    যৌবনের জরুরী চিঠিগুলো
    পড়ে পড়ে শুনাবে আমাকে
    যে গুলো পুরনো বাক্সের ভিতরে
    আজও অখোলা রয়ে গেছে ।

    ছিলাম আমি এতদিন অভিভাবকহীন
    গোলাপের রঙ
    ভালোভাবে দেখায়নি আমাকে
    কেউ কোনদিন
    ঘাসফুলের কাছে যেতে যেতে
    কেটে গেলো বহুদিন
    তুমিই এখন আমার বুকের প্রথম ভায়োলিন । '''),
    PoemModel("কিশোরী মন ", "শাহ জামাল উদ্দিন ", '''যেন তার অল্প বয়সী মন
    মানে না বারন মনে না শাসন
    যদিও অনেক হয়েছে বয়স এখন।

    হরিনীর মত ছোটাছুটি করে
    লোকে কত কি যে বলে
    দরজা বন্ধ করে দিলে
    পালিয়ে যায় জানালার কপাট খুলে ।

    যায় নদী তীরে বরশীতে মাছ ধরে
    সাঁতার কাটে ঘোলাজলে
    মেঠোপথে ঘুরে ঘুরে সন্ধায় বাড়ি ফিরে ।

    প্রজাপতিদের সাথে নিয়ে
    ফুলের বাগানে খেলা করে
    কখনো বসে থাকে চৈত্রের দুপুরে
    মরাগাছের মগডালে
    মনে না বারন মনে না শাসন
    চঞ্চলা হয়ে ওঠে কিশোরী মন
    যদিও অনেক হয়েছে বয়স এখন ।

    মাঝে মাঝে উড়ে যায় মনেমনে
    পাখি হয়ে বহুদূরে
    আবার ফিরে এসে বাস করে
    মায়াময় পৃথিবীর এককোনে নিরবে ।

    যেন তার কিশোরী মন
    মানে না বারন মনে না শাসন । '''),
    PoemModel("শেষ শিরোনাম তুমি ", "শাহ জামাল উদ্দিন ",
        '''বহুদিন পরে বহু খোঁজাখুঁজি করে
    পেয়েছি তোমার হাতে লিখা
    গোপনে রেখে যাওয়া একটি চিঠি- অখোলা
    নিসর্গের নির্জন বালিকা
    সেখানে তোমার নাম লিখা ।

    আমার গোপন পরাজয়
    আজ সবকিছু বললাম তোমাকে
    তুমি মুখ তুলে বললে
    কেন আরো আগে ডাকোনি আমাকে ।

    দুই চোখে জল ভরে তাকালে আমার দিকে
    সব দুঃখ বুকে নিয়ে
    তোমার কোমল আঁচল দিয়ে
    মুছে দিলে আমার ব্যর্থতার গ্লানি
    আমার জীবনের শেষ শিরোনাম তুমি । '''),
  ];
}
